Revit 2027 API
Dimension.ValueString Property
 The dimension value as a user visible string.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string ValueString { get; }
Public ReadOnly Property ValueString As String
	Get
public:
property String^ ValueString {
	String^ get ();
}
member ValueString : string with get
Property Value
String
Remarks
 This property always return null if this is a spot dimension, or it is a linear dimension with more than one segments.
See Also
Reference
Dimension Class
Autodesk.Revit.DB Namespace